In [1]:
import numpy as np 
import pandas as pd 
import datetime

In [2]:
Student_R = {\
    'Student_ID' :['S1','S2', 'S3'],\
    'Birth_date' : [datetime.date(1996,7,14),\
                    datetime.date(1997,8,22),\
                    datetime.date(1998,5,11)]}

In [3]:
Student_R = pd.DataFrame(Student_R,\
    columns = ['Student_ID', 'Birth_date'])

In [4]:
Courses = {\
    'Student_ID' : ['S1','S2','S3','S1','S2','S3'], \
        'Grades' : [18,11,12,15,19,10]}

In [5]:
Courses = pd.DataFrame(Courses, \
    columns = ['Student_ID','Grades'])

In [6]:
Student_R['year'] = pd.DatetimeIndex(Student_R['Birth_date']).year

In [7]:
print(Student_R)

  Student_ID  Birth_date  year
0         S1  1996-07-14  1996
1         S2  1997-08-22  1997
2         S3  1998-05-11  1998

In [8]:
goper = Courses.groupby('Student_ID')['Grades'].\
    agg(['mean','max','min'])

In [9]:
goper.columns = ['mean_grade','max_grade','min_grade']

In [10]:
goper

            mean_grade  max_grade  min_grade
Student_ID
S1                16.5         18         15
S2                15.0         19         11
S3                11.0         12         10

In [15]:
R = Student_R.merge(goper, left_on= 'Student_ID', \
    right_index = True, how='left'). \
        head()

In [16]:
R

  Student_ID  Birth_date  year  mean_grade  max_grade  min_grade
0         S1  1996-07-14  1996        16.5         18         15
1         S2  1997-08-22  1997        15.0         19         11
2         S3  1998-05-11  1998        11.0         12         10